Revit 2024 API
SpecTypeId.PipingTemperature Property
 Temperature, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId PipingTemperature { get; }
Visual Basic
Public Shared ReadOnly Property PipingTemperature As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PipingTemperature {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace